data_generation/simulation_results/openfoam/case_5/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    empty
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          19964;
        startFace       19562;
    }
    walls
    {
        type            wall;
        physicalType    patch;
        inGroups        1(wall);
        nFaces          392;
        startFace       39526;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       39918;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       39968;
    }
    fluid_to_pcb
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          114;
        startFace       40018;
        sampleMode      nearestPatchFace;
        sampleRegion    pcb;
        samplePatch     pcb_to_fluid;
    }
    fluid_to_component_1
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          60;
        startFace       40132;
        sampleMode      nearestPatchFace;
        sampleRegion    component_1;
        samplePatch     component_1_to_fluid;
    }
    fluid_to_component_3
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          20;
        startFace       40192;
        sampleMode      nearestPatchFace;
        sampleRegion    component_3;
        samplePatch     component_3_to_fluid;
    }
    fluid_to_component_2
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          36;
        startFace       40212;
        sampleMode      nearestPatchFace;
        sampleRegion    component_2;
        samplePatch     component_2_to_fluid;
    }
    fluid_to_component_0
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          36;
        startFace       40248;
        sampleMode      nearestPatchFace;
        sampleRegion    component_0;
        samplePatch     component_0_to_fluid;
    }
    fluid_to_component_4
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          46;
        startFace       40284;
        sampleMode      nearestPatchFace;
        sampleRegion    component_4;
        samplePatch     component_4_to_fluid;
    }
)

// ************************************************************************* //
