data_generation/simulation_results/openfoam/case_5/constant/simParams
nIter 2000;
hComponent0 586.3116686456474;
hComponent1 1172.0038642692455;
hComponent2 1346.5511776129945;
hComponent3 778.7106037218266;
hComponent4 669.9006943840768;kComponent0 77.95216833163256;
kComponent1 20.083934179985558;
kComponent2 44.89927473156267;
kComponent3 45.734550047316105;
kComponent4 52.78803044257414;
tAmbient 300;
Ux 2.6153562853489563;
kPCB 0.7331824624166107;